In [1]:
import pandas as pd

 Scarica questi dati (http://dati.ustat.miur.it/dataset/laureati) in formato csv e utilizza pandas per: 
 - caricare i dati di ciascun csv all’interno di un dataframe; 
 - creare un’aggregazione del numero di laureati per ateneo; 
 - creare un’aggregazione del numero di laureati per residenza; 
 - creare un’aggregazione del numero di laureati per sesso; 
 - creare un’aggregazione del numero di laureati per tipo di laurea; 
 - creare un’aggregazione del numero di laureati per sesso e per tipo di laurea.

In [3]:
ateneo = pd.read_csv("laureatixateneo.csv", sep=";")
ateneo

      AnnoS  AteneoCOD          AteneoNOME SESSO   Lau
0      2020        101              Torino     F  9109
1      2020        101              Torino     M  5845
2      2020        102  Torino Politecnico     F  2301
3      2020        102  Torino Politecnico     M  5363
4      2020        201  Piemonte Orientale     F  1372
...     ...        ...                 ...   ...   ...
1972   2010       8701             Catania     M  2709
1973   2010       9001             Sassari     F  1150
1974   2010       9001             Sassari     M   610
1975   2010       9201            Cagliari     F  2649
1976   2010       9201            Cagliari     M  1447

[1977 rows x 5 columns]

In [7]:
residenza = pd.read_csv("laureatixresidenza.csv", sep=";")
residenza

      AnnoS  IstatP              ResidenzaP SESSO   Lau
0      2020       1                  TORINO     F  6512
1      2020       1                  TORINO     M  5357
2      2020       2                VERCELLI     F   410
3      2020       2                VERCELLI     M   305
4      2020       3                  NOVARA     F  1028
...     ...     ...                     ...   ...   ...
2393   2010     111            SUD SARDEGNA     M   504
2394   2010     998        PROVINCIA ESTERA     F  1553
2395   2010     998        PROVINCIA ESTERA     M  1312
2396   2010     999  PROVINCIA NON DEFINITA     F    49
2397   2010     999  PROVINCIA NON DEFINITA     M    43

[2398 rows x 5 columns]

In [8]:
corso = pd.read_csv("laureatixtipocorso.csv", sep=";")
corso

     AnnoS                                       CorsoTIPO SESSO    Lau
0     2020                              Laurea - dm 270/04     M  84357
1     2020  Laurea Specialistica a Ciclo Unico - dm 509/99     M    350
2     2020                Laurea Specialistica - dm 509/99     F    131
3     2020           Corsi di Laurea - vecchio ordinamento     F    524
4     2020                             Laurea  - dm 509/99     M    832
..     ...                                             ...   ...    ...
149   2010                              Laurea - dm 270/04     M   2442
150   2010                Laurea Specialistica - dm 509/99     M  30780
151   2010                   Laurea Magistrale - dm 270/04     F   5599
152   2010                              Laurea - dm 270/04     F   2731
153   2010                             Laurea  - dm 509/99     F  92608

[154 rows x 4 columns]

In [10]:
dati = pd.DataFrame()
dati

Empty DataFrame
Columns: []
Index: []

In [12]:
dataframe_dati = [ateneo,residenza,corso]

In [21]:
# ES1

for dataframe in dataframe_dati:
    for nome_colonna in dataframe.columns:
        dati[nome_colonna] = dataframe[nome_colonna]
        
dati

,AnnoS,AteneoCOD,AteneoNOME,SESSO,Lau,IstatP,ResidenzaP,CorsoTIPO
0,2020.0,101,Torino,M,84357.0,1,TORINO,Laurea - dm 270/04
1,2020.0,101,Torino,M,350.0,1,TORINO,Laurea Specialistica a Ciclo Unico - dm 509/99
2,2020.0,102,Torino Politecnico,F,131.0,2,VERCELLI,Laurea Specialistica - dm 509/99
3,2020.0,102,Torino Politecnico,F,524.0,2,VERCELLI,Corsi di Laurea - vecchio ordinamento
4,2020.0,201,Piemonte Orientale,M,832.0,3,NOVARA,Laurea - dm 509/99
...,...,...,...,...,...,...,...,...
1972,NaN,8701,Catania,NaN,NaN,6,ALESSANDRIA,NaN
1973,NaN,9001,Sassari,NaN,NaN,6,ALESSANDRIA,NaN
1974,NaN,9001,Sassari,NaN,NaN,7,AOSTA,NaN
1975,NaN,9201,Cagliari,NaN,NaN,7,AOSTA,NaN
1976,NaN,9201,Cagliari,NaN,NaN,8,IMPERIA,NaN

In [22]:
dati.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1977 entries, 0 to 1976
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   AnnoS       154 non-null    float64
 1   AteneoCOD   1977 non-null   int64
 2   AteneoNOME  1977 non-null   object
 3   SESSO       154 non-null    object
 4   Lau         154 non-null    float64
 5   IstatP      1977 non-null   int64
 6   ResidenzaP  1977 non-null   object
 7   CorsoTIPO   154 non-null    object
dtypes: float64(2), int64(2), object(4)
memory usage: 123.7+ KB

In [25]:
# ES2

dati[["Lau", "AteneoNOME"]].groupby("AteneoNOME").sum()

                                                Lau
AteneoNOME
Aosta                                        1154.0
Bari                                        36379.0
Bari Politecnico                            95339.0
Basilicata                                      0.0
Benevento Giustino Fortunato - telematica   22467.0
...                                             ...
Udine                                        3769.0
Urbino                                       3794.0
Venezia C� Foscari                          14648.0
Venezia Iuav                                 2626.0
Verona                                     100505.0

[91 rows x 1 columns]

In [24]:
# ES3

dati[["Lau", "ResidenzaP"]].groupby("ResidenzaP").sum()

                    Lau
ResidenzaP
AGRIGENTO           0.0
ALESSANDRIA    109692.0
ANCONA           2181.0
AOSTA           73770.0
AREZZO          34368.0
...                 ...
VERCELLI          655.0
VERONA         100505.0
VIBO VALENTIA       0.0
VICENZA         14648.0
VITERBO         70882.0

[109 rows x 1 columns]

In [26]:
# ES4

dati[["Lau", "SESSO"]].groupby("SESSO").sum()

             Lau
SESSO
F      2005140.0
M      1445010.0

In [27]:
# ES5

dati[["Lau", "CorsoTIPO"]].groupby("CorsoTIPO").sum()

                                                      Lau
CorsoTIPO
Corsi di Laurea - vecchio ordinamento             80041.0
Laurea  - dm 509/99                              553503.0
Laurea - dm 270/04                              1414358.0
Laurea Magistrale - dm 270/04                    853938.0
Laurea Magistrale a Ciclo Unico - dm 270/04      292604.0
Laurea Specialistica - dm 509/99                 168204.0
Laurea Specialistica a Ciclo Unico - dm 509/99    87502.0

In [28]:
# ES6

dati[["Lau", "CorsoTIPO", "SESSO"]].groupby(["CorsoTIPO","SESSO"]).sum()

                                                           Lau
CorsoTIPO                                      SESSO
Corsi di Laurea - vecchio ordinamento          F       58172.0
                                               M       21869.0
Laurea  - dm 509/99                            F      320063.0
                                               M      233440.0
Laurea - dm 270/04                             F      815910.0
                                               M      598448.0
Laurea Magistrale - dm 270/04                  F      484338.0
                                               M      369600.0
Laurea Magistrale a Ciclo Unico - dm 270/04    F      180972.0
                                               M      111632.0
Laurea Specialistica - dm 509/99               F       91285.0
                                               M       76919.0
Laurea Specialistica a Ciclo Unico - dm 509/99 F       54400.0
                                               M       33102.0